---
title: FabricationConnectorInfo
classe: Autodesk.Revit.DB.FabricationConnectorInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# FabricationConnectorInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 BodyConnectorId { get; set; }` | `fabricationConnectorInfo.BodyConnectorId` | Int32 |
| `Int32 DoubleWallConnectorId { get; set; }` | `fabricationConnectorInfo.DoubleWallConnectorId` | Int32 |
| `Int32 FabricationIndex { get; }` | `fabricationConnectorInfo.FabricationIndex` | Int32 |
| `Boolean IsBodyConnectorLocked { get; set; }` | `fabricationConnectorInfo.IsBodyConnectorLocked` | Boolean |
| `Boolean IsDoubleWallConnectorLocked { get; set; }` | `fabricationConnectorInfo.IsDoubleWallConnectorLocked` | Boolean |
| `Boolean IsValidObject { get; }` | `fabricationConnectorInfo.IsValidObject` | Boolean |
| `Void Dispose()` | `fabricationConnectorInfo.Dispose()` | Void |
| `Boolean HasDoubleWallConnector()` | `fabricationConnectorInfo.HasDoubleWallConnector()` | Boolean |
| `Boolean IsValid()` | `fabricationConnectorInfo.IsValid()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```